<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('products')->insert(
            ['name' => 'HP OMEN 25L GT12-1053ur', 'category_id' => 1, 'image' => '/img/products/hp.jpg', 'description' => 'HP OMEN 25L GT12 - это мощные компоненты и передовая система охлаждения — твоя выигрышная комбинация. Простота обновления и настройки программного обеспечения под свои задачи - и ты получаешь бесконечное удовольствие от игры. Боковые панели из закаленного стекла, лицевая панель с эффектом грубой шлифовки и настраиваемая подсветка RGB.', 'price' => 109999.99]
        );
        DB::table('products')->insert(
            ['name' => 'ASUS ROG Strix G15DK', 'category_id' => 1, 'image' => '/img/products/strix.jpg', 'description' => 'Боевая станция Asus G15DK – весомое преимущество в киберспортивных дисциплинах. Разработанный специально для того, чтобы обеспечить максимально плавную игровую картинку, этот компактный компьютер обладает мощной конфигурацией, в которую входит видеокарта NVIDIA GeForce и процессор AMD Ryzen 5.', 'price' => 109999.99]
        );
        DB::table('products')->insert(
            ['name' => 'Lenovo Legion T5 26IOB6', 'category_id' => 1, 'image' => '/img/products/lenovo.jpg', 'description' => 'ПК Lenovo Legion T5 26IOB6 [90RT0044RS] оснащен процессором Intel Core i5-11400F, который подходит не только для офисной работы, но и для безудержного гейминга. Для этого «сердце» устройства дополнено дискретной видеокартой GeForce RTX 3070 и оперативной памятью 16 ГБ. SSD-накопитель рассчитан на хранение до 256 ГБ информации. Это могут быть и полезные владельцу файлы, программы, и видеоигры. Вся эта начинка заключена в среднеразмерный стильный корпус формата Mid-Tower. Также ПК Lenovo Legion T5 26IOB6 [90RT0044RS] дополнен целым набором портов и интерфейсов для подключения монитора и периферии.', 'price' => 119999.99]
        );
        DB::table('products')->insert(
            ['name' => 'ARDOR GAMING RAGE H292', 'category_id' => 1, 'image' => '/img/products/ardor.jpg', 'description' => 'ПК ARDOR GAMING RAGE H292 представлен в форм-факторе Mid-Tower и имеет классическую черную расцветку корпуса. Высокая производительность делает данную модель подходящей для любого геймера. Процессор Intel Core i5-12400F с 6 ядрами и 12 потоками, с максимальной тактовой частотой до 4.4 ГГц. Охлаждение процессора представлено башенным кулером DEEPCOOL GAMMAXX GT BK. Для быстродействия при работе в многозадачном режиме имеется 32 гигабайта оперативной памяти стандарта DDR4 с частотой 3200 МГц, работающей в двухканальном режиме. Для хранения данных компьютер оснащен SSD M.2 - накопителем c интерфейсом PCIe 3.0 объемом 1 терабайт. Для сочной картинки с большим количеством кадров в секунду установлена видеокарта GIGABYTE GeForce RTX 3070 GAMING OC (LHR)с 8 гигабайтами видеопамяти стандарта GDDR6. Для подключения мониторов предусмотрено четыре видеоразъема: DisplayPort (3 шт.) и HDMI, а для различной периферии и аудиотехники имеются пять портов USB 2.0, пять интерфейсов USB 3.2 Gen1, один USB 3.2 Gen2 Type-C, а также комбинированный аудиоразъем jack 3.5 мм для наушников или микрофона.', 'price' => 99999.99]);
        DB::table('products')->insert(
            ['name' => 'MSI MAG Infinite S3', 'category_id' => 1, 'image' => '/img/products/msi.jpg', 'description' => 'Изначально задумывавшийся как геймерская платформа, компьютер MAG Infinite S3 может похвастать уникальным дизайном, в котором красота гармонично сочетается с функциональностью. Персонализируемая полноцветная подсветка оживляет всю систему, а большие воздухозаборники гарантируют эффективную вентиляцию.', 'price' => 97999.99]
        );
        DB::table('products')->insert(
            ['name' => 'Apple MacBook Air', 'category_id' => 1, 'image' => '/img/products/mac.jpg', 'description' => 'Ноутбук Apple MacBook Air позволяет с удобством работать благодаря эргономичной тихой клавиатуре с подсветкой и широкой мультисенсорной панели. Акустическая система со стереодинамиками воспроизводит четкий насыщенный звук. Также ноутбук получил веб-камеру, востребованные интерфейсы проводной и беспроводной связи, сканер отпечатка пальцев. Литий-полимерный аккумулятор способен обеспечить около 18 часов автономной работы и поддерживает функцию ускоренной зарядки.', 'price' => 90999.99]
        );
        DB::table('products')->insert(
            ['name' => 'ASUS VivoBook', 'category_id' => 1, 'image' => '/img/products/vivobook.jpg', 'description' => 'Этот ноутбук создан для тех, кто хочет получить хорошее производительное компьютерное устройство с наиболее востребованным функционалом. Данная модель полностью удовлетворяет данные требования. Надежный накопитель предоставляет вам возможности для долговременного хранения необходимой виртуальной информации. Устройство оборудовано веб-камерой и микрофоном, благодаря которым вы сможете организовывать видеоконференции с партнерами по бизнесу и коллегами по работе.', 'price' => 79999.99]
        );
        DB::table('products')->insert(
            ['name' => 'iPhone X 64GB', 'category_id' => 2, 'image' => '/img/products/iphone-x-64-gb.jpg', 'description' => 'Отличный продвинутый телефон с памятью на 64 gb', 'price' => 71990.99]
        );
        DB::table('products')->insert(
            ['name' => 'iPhone X 256GB', 'category_id' => 2, 'image' => '/img/products/iphone-x-256-gb.jpg', 'description' => 'Отличный продвинутый телефон с памятью на 256 gb', 'price' => 89990.99]
        );
        DB::table('products')->insert(
            ['name' => 'HTC One S', 'category_id' => 2, 'image' => '/img/products/htc-one-s.jpg', 'description' => 'Зачем платить за лишнее? Легендарный HTC One S', 'price' => 12490.99]
        );
        DB::table('products')->insert(
            ['name' => 'Microsoft Windows 10 Home', 'category_id' => 3, 'image' => '/img/products/windows.jpg', 'description' => 'Операционная система Microsoft Windows 10 Домашняя предоставит вам полный набор функциональных возможностей и богатый выбор приложений различной направленности для комфортной работы на компьютерном устройстве. Данный софт - платформа, которой пользуется подавляющее большинство пользователей со всего света. Она представлена в редакции Home, включающей в себя оптимальный перечень программ и приложений для использования на домашнем компьютере. Операционная система поддерживает как 32-битную, так и 64-битную разрядность, что существенно расширяет возможности ее приобретения.\n
                Неоспоримым преимуществом операционной системы Microsoft Windows 10 Домашняя является отсутствие необходимости продления срока ее действия: приобретая эту платформу, вы будете обеспечены неограниченным сроком действия лицензии. Поставляется платформа на USB-флеш накопителе в BOX-издании. Минимальным набором требований к техническому оснащению компьютера, необходимому для оптимальной работы данной операционной системы, являются: частота от 1 ГГц, 1 ГБ оперативной памяти и 16 ГБ свободного пространства на жестком диске.', 'price' => 19999.99]
        );
        DB::table('products')->insert(
            ['name' => '1С:Предприятие 8', 'category_id' => 3, 'image' => '/img/products/1c.jpg', 'description' => 'ПО 1С Бухгалтерия государственного учреждения 8 базовая версия – набор программ, использующийся для автоматизации деятельности частных лиц, различных предприятий и государственных учреждений. Благодаря гибкой технической платформе, легшей в основу представленной системы, обеспечивается возможность создания и модификации разных бизнес-приложений. Программное обеспечение обладает широчайшими функциональными возможностями, ориентированными на решение разнообразных задач. Поддержка оперативного управления предприятием, ведение бухгалтерского учета, автоматизация предприятий и многое другое можно решить при помощи этого ПО.\n
                ПО 1С Бухгалтерия государственного учреждения 8 базовая версия порадует своим интерфейсом, который можно легко освоить начинающему пользователю. Для более опытных сотрудников программное обеспечение предоставит возможность высокой скорости работы. Взаимодействие с различными приложениями позволит построить сложные интегрированные решения, ориентированные на особенности деятельности определенных предприятий', 'price' => 1999.99]
        );
        DB::table('products')->insert(
            ['name' => 'Kaspersky Internet Security', 'category_id' => 3, 'image' => '/img/products/kaspersky.jpg', 'description' => 'Антивирус Kaspersky Internet Security Multi-Device – лицензионная программа для защиты любого цифрового устройства на основе операционных систем Android, MAC OS X, Windows. Пароли, интернет-платежи и прочие конфиденциальные данные владельца будут в безопасности. Программа рассчитана на 36 мес использования. Она поставляется в коробке. Антивирус Kaspersky Internet Security Multi-Device предназначен для чистой установки. Надежность, высокая степень защиты и простота использования – главные достоинства этой программы.', 'price' => 499.99]
        );
        DB::table('products')->insert(
            ['name' => 'Dr.Web Mobile Security', 'category_id' => 3, 'image' => '/img/products/dr-web.jpg', 'description' => 'Установите на мобильное устройство комплексное антивирусное решение Dr.Web Mobile Security — это позволит защищаться от всех типов вредоносного ПО, используемого мошенниками для совершения киберпреступлений. В его состав должны входить антивирус, Фильтр звонков и SMS, антивор и URL-фильтр.', 'price' => 17221.99]
        );
        DB::table('products')->insert(
            ['name' => 'Intel Core i9-12900F OEM', 'category_id' => 4, 'image' => '/img/products/i9.jpg', 'description' => 'Процессор Intel Core i9-12900K выполнен на базе архитектуры Alder Lake-S, использует техпроцесс 10 нм и отличается высокой производительностью и эффективностью, что позволит с легкостью выполнять любые задачи. Благодаря этому данная модель может стать отличным выбором для игровых систем и мощных рабочих станций.\n
                За производительность Intel Core i9-12900K отвечает 8 производительных, 8 энергоэффективных ядер и 24 потока, которые могут работать в широком диапазоне частот с возможностью дополнительного разгона за счет свободного множителя. Благодаря этому, а также большому кэшу разных уровней процессор может обеспечить высокое быстродействие в самых разных условиях. Другой особенностью является поддержка до 128 ГБ оперативной памяти, что позволит создать бескомпромиссное решение для работы и развлечений. Процессор использует сокет LGA 1700 и свежий чипсет 600 серии.', 'price' => 36499.99]
        );
        DB::table('products')->insert(
            ['name' => 'Intel Core i7-12700K OEM', 'category_id' => 4, 'image' => '/img/products/i7.jpg', 'description' => 'Процессор Intel Core i7-12700K выполнен на базе архитектуры Alder Lake-S, использует техпроцесс 10 нм и отличается высокой производительностью и эффективностью, что позволит с легкостью выполнять любые задачи. Благодаря этому данная модель может стать отличным выбором для игровых систем и мощных рабочих станций.\n
                За производительность Intel Core i7-12700K отвечает 8 производительных, 4 энергоэффективных ядер и 20 потоков, которые могут работать в широком диапазоне частот с возможностью дополнительного разгона за счет свободного множителя. Благодаря этому, а также большому кэшу разных уровней процессор может обеспечить высокое быстродействие в самых разных условиях. Другой особенностью является поддержка до 128 ГБ оперативной памяти, что позволит создать бескомпромиссное решение для работы и развлечений. Процессор использует сокет LGA 1700 и свежий чипсет 600 серии.', 'price' => 30999.99]
        );
        DB::table('products')->insert(
            ['name' => 'AMD Ryzen 7 7700X BOX', 'category_id' => 4, 'image' => '/img/products/7.jpg', 'description' => 'Процессор AMD Ryzen 7 7700X – это мощное решение для игровых систем и рабочих станций. В основе модели используются высококачественные компоненты и передовые технологии, что в связке с большим числом физических ядер и виртуальных потоков может обеспечить непревзойденно высокую вычислительную мощность в любых сценариях использования компьютера.
                Поддерживаемые AMD Ryzen 7 7700X частоты могут варьироваться от 4.5 до 5.4 ГГц. Благодаря этому, а также свободному множителю данная модель отличается высоким уровнем быстродействия и большим потенциалом для его дальнейшего развития.\n
                Объем поддерживаемой временной памяти может достигать 128 ГБ. Также вычислительный модуль поддерживает работу с интерфейсом PCI-E 5 поколения, что открывает широкие возможности для создания бескомпромиссной компьютерной системы для работы и развлечений.\n
                Помимо высокой производительности процессор также отличается тепловыделением, которое не превышает 105 Вт. Для охлаждения могут использоваться как воздушные, так и водяные системы. Установка на материнскую плату производится при помощи сокета AM5.', 'price' => 31499.99]
        );
        DB::table('products')->insert(
            ['name' => 'AMD Ryzen 5 5600X OEM', 'category_id' => 4, 'image' => '/img/products/5.jpg', 'description' => 'Процессор AMD Ryzen 5 5600X OEM представляет собой производительное решение для игровых систем и рабочих станций. Данная модель выполнена на основе архитектуры Vermeer по техпроцессу 7 нм, что вкупе с 6 физическими ядрами и 12 виртуальными потоками обеспечит высокую вычислительную мощность в самых разных задачах. Диапазон рабочих частот процессора может варьироваться от 3.7 до 4.6 ГГц и при помощи свободного множителя может быть повышен для достижения еще большей производительности. Максимальный объем оперативной памяти может составлять 128 ГБ типа DDR4. Встроенный в процессор контроллер PCI-E соответствует версии 4.0. Также модель поддерживает широкий набор команд, инструкций и технологий виртуализации, что делает данное решение универсальным выбором как для профессиональной работы, так и развлечений.\n
                Максимальное тепловыделение процессора AMD Ryzen 5 5600X OEM составляет 65 Вт. Температура при максимальной нагрузке может достигать 95°C. Модель поддерживает различные системы водяного и воздушного охлаждения. Для установки на материнскую плату используется сокет AM4.', 'price' => 14499.99]
        );
        DB::table('products')->insert(
            ['name' => 'GIGABYTE GeForce RTX 4090', 'category_id' => 4, 'image' => '/img/products/gigabyte.jpg', 'description' => 'Графические процессоры NVIDIA GeForce RTX 40 обеспечивают невероятную скорость для игр и творчества. Они созданы на основе сверхэффективной архитектуры NVIDIA Ada Lovelace, которая обеспечивает качественный скачок как в производительности, так и в графических возможностях на базе ИИ. Погрузитесь в виртуальные миры с трассировкой лучей и сверхвысоким FPS с минимальной задержкой. Используйте возможности для творчества с беспрецедентным ускорением рабочего процесса.', 'price' => 149999.99]
        );
        DB::table('products')->insert(
            ['name' => 'ASUS TUF RTX 3060', 'category_id' => 4, 'image' => '/img/products/tuf.jpg', 'description' => 'Видеокарта ASUS TUF Gaming GeForce RTX 3060 OC Edition (LHR) способна предложить геймерам высокий уровень производительности, стабильности и надежности. Данная модель основана на процессоре GeForce RTX 3060 и оснащена 12 ГБ видеопамяти. Номинальная частота процессора находится на уровне показателя 1320 МГц и способна увеличиваться до значения 1882 МГц в режиме разгона.\n
                Эффективное и быстрое отведение тепла от контроллера достигается благодаря кулеру с тремя осевыми вентиляторами. Для подключения к устройствам вывода изображения предлагаются 3 разъема DisplayPort и 2 HDMI. Среди других особенностей ASUS TUF Gaming GeForce RTX 3060 отмечаются многоцветная подсветка элементов платы и переключатель BIOS.', 'price' => 36999.99]
        );
        DB::table('products')->insert(
            ['name' => 'TP-LINK Archer C80', 'category_id' => 5, 'image' => '/img/products/c80.jpg', 'description' => 'Wi-Fi роутер TP-LINK Archer C80(RU) гарантирует возможность скоростного проводного и беспроводного подключения к Интернету дома или в офисе. Два производительных модуля Wi-Fi (2.4 и 5 ГГц) дополнены четырьмя гигабитными портами. Производительность маршрутизатора позволяет обеспечивать не только быстрое, но и стабильное соединение. Скоростные возможности роутера достаточны для успешного решения любых, даже самых сложных задач. Максимальная скорость обмена информацией на частоте 2.4 ГГц равна 600 Мбит/с, а на частоте 5 ГГц – 1300 Мбит/с. Роутер способен «обслужить» большое количество беспроводных подключений одновременно.\n
                Роутер TP-LINK Archer C80(RU) несложен в настройке. В устройства реализована функция родительского контроля. Допускается формирование гостевой сети Wi-Fi.\n
                Допустимая температура использования роутера – от 0 до 40 °C. Работа устройства допускается только внутри помещений. Маршрутизатор можно установить на стене. В комплекте – блок питания, документация и патч-корд. Корпус роутера имеет габаритные размеры 215x117x32.5 мм.', 'price' => 3999.99]
        );
        DB::table('products')->insert(
            ['name' => 'TP-Link Archer AX53', 'category_id' => 5, 'image' => '/img/products/ax53.jpg', 'description' => 'Оригинальный Wi-Fi-роутер TP-Link Archer AX53 черного цвета оснащен 2-ядерным процессором, рабочая частота которого 1.5 ГГц. Благодаря этому он способен выполнять функцию маршрутизатора и точки доступа. Внешние несъемные антенны (4 шт.) обеспечивают достаточно мощный сигнал (20 dBm), что позволяет роутеру одновременно работать в 2 диапазонах (2.4 ГГц и 5 ГГц). Максимальная скорость Wi-Fi-соединения при этом может составлять 2976 Мбит/с. Поддержка режима OneMesh поможет создать стабильное покрытие сетью в большой квартире, доме или офисе.\n
                В Wi-Fi-роутере TP-Link Archer AX53 используется технология многопотоковой передачи данных MU-MIMO, благодаря которой к нему можно подключать большое количество устройств без потери скорости. Также на его корпусе предусмотрены 4 LAN-порта для проводного подключения, что позволит смотреть видео в формате 4К и играть в онлайн-игры. Для безопасного соединения в роутер встроен межсетевой экран и используется режим родительского контроля. Настройка роутера происходит через мобильное приложение.', 'price' => 4399.99]
        );
        DB::table('products')->insert(
            ['name' => 'Keenetic Giga', 'category_id' => 5, 'image' => '/img/products/giga.jpg', 'description' => 'Wi-Fi роутер Keenetic Giga стандарта AX1800 обеспечивает высокоскоростной доступ к сети Интернет для нескольких устройств одновременно. Максимальная скорость в двух частотных диапазонах достигает 1775 Мбит/с. Благодаря технологии IntelliQoS с приоритезацией трафика повышается качество соединения. Для проводного подключения необходимой техники в Keenetic Giga имеются 4 порта LAN 1000 Мбит/с. С помощью порта USB можно подключить к роутеру модем, принтер или накопитель. На корпусе расположены 4 антенны, действие которых направлено на улучшение сигнала и расширение зоны действия. Приложение на смартфоне и простой веб-интерфейс гарантируют удобную настройку параметров.', 'price' => 10999.99]
        );
        DB::table('products')->insert(
            ['name' => 'ASUS RT-AX55', 'category_id' => 5, 'image' => '/img/products/rt.jpg', 'description' => 'Оснащенный 1.5-гигагерцовым 4-ядерным процессором Wi-Fi роутер ASUS RT-AX55 обладает уровнем производительности, позволяющим без каких-либо сложностей обрабатывать большие массивы данных. Взаимодействие с Интернет-ресурсами будет комфортным даже в случае большого количества одновременно подключенных устройств. «Дальнобойность» роутера при этом позволяет обеспечивать отсутствие «белых пятен» в карте покрытия Wi-Fi в квартирах и домах большой площади.\n
                Wi-Fi роутер ASUS RT-AX55 использует оба диапазона Wi-Fi. Скорость на частоте 5 ГГц ограничена 1201 Мбит/с. Соответствующий показатель для диапазона 2.4 ГГц равен 574 Мбит/с. Проводное подключение организуется посредством четырех гигабитных портов.\n
                Эксплуатация роутера возможна только в помещениях. Источник питания устройства – электрическая сеть. В комплектацию модели входят адаптер питания, инструкция и патч-корд. Роутер собран в корпусе черного цвета, имеющем размеры 230x134x56 мм.', 'price' => 5999.99]
        );
        DB::table('products')->insert(
            ['name' => 'Наушники Beats Audio', 'category_id' => 6, 'image' => '/img/products/beats-audio.jpg', 'description' => 'Отличный звук от Dr. Dre', 'price' => 20221.99]
        );
        DB::table('products')->insert(
            ['name' => 'Камера GoPro', 'category_id' => 6, 'image' => '/img/products/go-pro.jpg', 'description' => 'Снимай самые яркие моменты с помощью этой камеры', 'price' => 12000.99]
        );
        DB::table('products')->insert(
            ['name' => 'Камера Panasonic HC-V770', 'category_id' => 6, 'image' => '/img/products/panasonic.jpg', 'description' => 'Для серьёзной видео съемки нужна серьёзная камера. Panasonic HC-V770 для этих целей лучший выбор!', 'price' => 27900.99]
        );
        DB::table('products')->insert(
            ['name' => 'Кофемашина DeLonghi', 'category_id' => 7, 'image' => '/img/products/delonghi.jpg', 'description' => 'Хорошее утро начинается с хорошего кофе!', 'price' => 25200.99]
        );
        DB::table('products')->insert(
            ['name' => 'Холодильник Haier', 'category_id' => 7, 'image' => '/img/products/haier.jpg', 'description' => 'Для большой семьи большой холодильник!', 'price' => 40200.99]
        );
        DB::table('products')->insert(
            ['name' => 'Блендер Moulinex', 'category_id' => 7, 'image' => '/img/products/moulinex.jpg', 'description' => 'Для самых смелых идей', 'price' => 4200.99]
        );
        DB::table('products')->insert(
            ['name' => 'Мясорубка Bosch', 'category_id' => 7, 'image' => '/img/products/bosch.jpg', 'description' => 'Любите домашние котлеты? Вам определенно стоит посмотреть на эту мясорубку!', 'price' => 9200.99]
        );
    }
}
